GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
#include <Arduino.h>
#include <ESP32Servo.h> // ONLY LIBRARY NECESARY FOR ESC 
#include <BluetoothSerial.h>
#include <PID.h>
#include <esp_now.h>
#include <WiFi.h>

// MARK: Function prototypes 
// because c++ is a liar

void stopAllDriveMotors();
void setSpeed(int speedA, int speedB);
void updateEncoderLeft();
void updateEncoderRight();
void driveDistance(float distance, int speed);
void turnDegrees(float degrees, int speed);
void forwards();
void backwards();
void left();
void right();
long readEncoderLeft();
long readEncoderRight();
long readEncoderGantry();
long distanceToEncoderTicks(float distanceMm);
int pidOutputToSpeed(double output, long error, int maxSpeed);
bool runToEncoderTargets(long leftTargetTicks, long rightTargetTicks, int speed);
void setGantryPower(int power);
void updateEncoderGantry();
bool setGantryPosition(int targetPos, int maxSpeed);
int readEncoderExtruder();

// MARK: Pinout

// Left Motor Pins
const int PWML = 23; 
const int L1 = 21; // const int L1 = 22;
const int L2 = 22; // const int L2 = 21;

// Right Motor Pins
const int PWMR = 19; 
const int R1 = 18;
const int R2 = 5;

// Gantry Motor Pins
const int ENI = 25;
const int Gantry1 = 27;
const int Gantry2 = 26; 

// Extruder Motor Pins
const int PWM_EXT = 14;
const int EXT1 = 12;
const int EXT2 = 4;

// Encoder Connections
const int ENCAFL = 34; // Encoder A pin for Front Left Motor
const int ENCBFL = 35; // Encoder B pin for Front Left Motor

const int ENCAFR = 32; // Encoder A pin for Front Right Motor
const int ENCBFR = 33; // Encoder B pin for Front Right Motor

const int ENCGANA = 36; // 1st Encoder Pin for Gantry
const int ENCGANB = 39; // 2nd Encoder Pin for Gantry 

const int ENCEXTA = 2;
const int ENCEXTB = 15;


byte servoPin = 13; // signal pin for the ESC.

Servo servo;
PID pidController = PID();
PID leftDrivePID = PID();
PID rightDrivePID = PID();
PID pidControllerGantry = PID();
PID pidControllerExt = PID();
BluetoothSerial BS;

// MARK: Variables

// Drivetrain PID values
double kP = 0.45;
double kI = 0.0035; 
double kD = 0.0;

double kP_gantry = 0.1;
double kI_gantry = 0;
double kD_gantry = 0;

double kP_ext = 0.1;
double kI_ext = 0;
double kD_ext = 0;

int cx = 0.85;
int cy = 0.2;
float ax[5] = {0,0,0,0,0};
float ay[5];

bool autonomous = false;

volatile long encoderValueLeft = 0;
volatile long encoderValueRight = 0;
volatile long encoderValueGantry = 0;
volatile long encoderValueExtruder = 0;

int targetPositionRight;
int targetPositionLeft;

int targetPositionGantry;
int minGantryPosition = 0;
int maxGantryPosition = 9996;
float gantryTicksPerMM = 9996 / 185.7;
bool hasZeroedGantry = false;

int targetPositionExtruder;
int minExtruderPosition = 0;
int maxExtruderPosition = 0;
bool hasZeroedExtruder;

const float wheelDiameter = 45.0; // mm
const long ticksPerRotation = 7*298; 
const float wheelCircumference = wheelDiameter * PI;
const float turnSlipCompensation = 0.8; // This is a fudge factor to account for the fact that the robot doesn't turn perfectly in place
const float trackWidth = 350.0; // mm
int movementSpeed = 255; // Speed for driving forward/backward (0-255)
const float rpmAtMaxSpeed = 100; // Maximum RPM of the motor at full speed - TODO
const float turnSpeed = 200; // Speed for turning left/right (0-255) - TODO
const int encoderToleranceTicks = 15;
const int minimumPIDSpeed = 55;
const unsigned long movementLoopDelayMs = 10;

const float cameraFOVWidthMM = 95.0; // Width of the camera's field of view in millimeters 
const float cameraFOVHeightMM = 70.0; // Height of the camera's field of view in millimeters 

int pwrGantry = 100;
int pwrExt = 100;

// MARK: Structs

// Structure example to receive data
// Must match the sender structure
typedef struct struct_message {
int vy1;
int vy2;
int vy3;
int vx2;
bool button1;
bool button2;
bool button3;
} struct_message;

// MARK: ESP-NOW Comms



// Create a struct_message called joystickData
struct_message joystickData = {1950, 1950, 1950, 1950, true, true, true};

// Callback function that will be executed when data is received
void OnDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
  memcpy(&joystickData, incomingData, sizeof(joystickData));
  // Serial.print("Bytes received: "); // Serial.println(len);
  // Serial.print("VY1 ");
  // Serial.println(joystickData.vy1);
  // Serial.print("VY2 ");
  // Serial.println(joystickData.vy2);
  // Serial.print("VY3 ");
  // Serial.println(joystickData.vy3);
  // Serial.print("VX2 ");
  // Serial.println(joystickData.vx2);
  // Serial.print("Button1: ");
  // Serial.println(joystickData.button1);
  // Serial.print("Button2: ");
  // Serial.println(joystickData.button2);
  // Serial.print("Button3: ");
  // Serial.println(joystickData.button3);
  
  // Serial.println();
}

// MARK: Movement Calculations

float RPM(float speed) {
  return rpmAtMaxSpeed * (speed / 255.0);
}

float mmPerSecond(float speed) {
  return (RPM(speed) * wheelCircumference) / 60;
}

float degreesPerSecond(float speed) {
  return (2 * mmPerSecond(speed) / trackWidth) * 180 / PI;
}

// MARK: Encoder Functions

long readEncoderLeft() {
  noInterrupts();
  long value = encoderValueLeft;
  interrupts();
  return value;
}

long readEncoderRight() {
  noInterrupts();
  long value = encoderValueRight;
  interrupts();
  return value;
}

long distanceToEncoderTicks(float distanceMm) {
  return lround((distanceMm / wheelCircumference) * ticksPerRotation);
}

int pidOutputToSpeed(double output, long error, int maxSpeed) {
  if (abs(error) <= encoderToleranceTicks) {
    return 0;
  }

  int pwm = abs(output);

  // Serial.print(" PWM Before Constrain: ");
  // Serial.print(pwm);

  // Serial.print(" Max Speed: ");
  // Serial.print(maxSpeed);
  // Serial.print(" PWM > Max Speed: ");
  // Serial.print(pwm > maxSpeed);
  if (pwm > maxSpeed) {
    pwm = maxSpeed;
  }
  
  // Serial.print(" PID Output: ");
  // Serial.print(output);
  // Serial.print(" PWM: ");
  // Serial.print(pwm);


  int speedFloor = min(minimumPIDSpeed, maxSpeed);
  if (pwm < speedFloor) {
    pwm = speedFloor;
  }

  return output >= 0 ? pwm : -pwm;
}

// MARK: PID Logic ish
bool runToEncoderTargets(long leftTargetTicks, long rightTargetTicks, int speed) {
  int maxSpeed = constrain(abs(speed), 0, 255);
  if (maxSpeed == 0 || (leftTargetTicks == 0 && rightTargetTicks == 0)) {
    stopAllDriveMotors();
    return true;
  }

  long startLeft = readEncoderLeft();
  long startRight = readEncoderRight();
  targetPositionLeft = startLeft + leftTargetTicks;
  targetPositionRight = startRight + rightTargetTicks;

  leftDrivePID.Init(kP, kI, kD);
  rightDrivePID.Init(kP, kI, kD);

