GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
  // Drive forward to the crack center
  driveDistance(distance, movementSpeed);

  // Rotate back to forwards
  turnDegrees(-angle, turnSpeed);
}

void driveToCrackCenterNoRot(float cx, float cy){
  float distance = distanceToCrackCenter(cx, cy);
  float angle = angleToCrackCenter(cx, cy);

  if (angle > 90) {
    angle -= 180;
    distance = -distance;
  } else if (angle < -90) {
    angle += 180;
    distance = -distance;
  }

  Serial.print("Driving to crack center: distance = ");
  Serial.print(distance);
  Serial.print(" mm, angle = ");
  Serial.print(angle);
  Serial.println(" degrees");

  // Rotate to face the crack center
  turnDegrees(angle, turnSpeed);
  
  // Drive forward to the crack center
  driveDistance(distance, movementSpeed);
}

void driveToCoordinate(float x, float y) {
  float distance = sqrt(x*x+y*y);
  float angle = atan2(x, y) * (180 / PI);;

  if (angle > 90) {
    angle -= 180;
    distance = -distance;
  } else if (angle < -90) {
    angle += 180;
    distance = -distance;
  }

  Serial.print("Driving to crack center: distance = ");
  Serial.print(distance);
  Serial.print(" mm, angle = ");
  Serial.print(angle);
  Serial.println(" degrees");

  // Rotate to face the crack center
  turnDegrees(angle, turnSpeed);
  
  // Drive forward to the crack center
  driveDistance(distance, movementSpeed);
}

void getPointAToPointB(float ax, float ay, float bx, float by) {
  
}

void getExtruderToPoint(float x, float y) {
  // Checking if the point is in range of the gantry

}



// MARK: Movement Functions

void forwards() {
  setSpeed(movementSpeed, movementSpeed);
}

void backwards() {
  setSpeed(-movementSpeed, -movementSpeed);
}

void left() {
  setSpeed(-turnSpeed, turnSpeed);
}

void right() {
  setSpeed(turnSpeed, -turnSpeed);
}

void stopLeftMotors() {
  digitalWrite(L1, HIGH);
  digitalWrite(L2, HIGH);
  digitalWrite(PWML, 0);
}

void stopRightMotors() {
  digitalWrite(R1, HIGH);
  digitalWrite(R2, HIGH);
  digitalWrite(PWMR, 0);
}

void stopAllDriveMotors() {
  stopLeftMotors();
  stopRightMotors();
}

void LeftMotorsForwards() {
  digitalWrite(L1, HIGH);
  digitalWrite(L2, LOW);
}

void RightMotorsForwards() {
  digitalWrite(R1, HIGH);
  digitalWrite(R2, LOW);
}

void LeftMotorsBackwards() {
  digitalWrite(L1, LOW);
  digitalWrite(L2, HIGH);
}

void RightMotorsBackwards() {
  digitalWrite(R1, LOW);
  digitalWrite(R2, HIGH);
}

void setSpeed(int left, int right){
  if (left == 0) {
    stopLeftMotors();
  } else if (left < 0) {
    LeftMotorsBackwards();
    left = -left;
  } else {
    LeftMotorsForwards();
  }

  if (right == 0) {
    stopRightMotors();
  } else if (right < 0) {
    RightMotorsBackwards();
    right = -right;
  } else {
    RightMotorsForwards();
  }
  analogWrite(PWML, left);
  analogWrite(PWMR, right);
}

// MARK: Gantry Functions

void gantryDirectionForward() {
  digitalWrite(Gantry1, HIGH);
  digitalWrite(Gantry2, LOW);
}

void gantryDirectionBackward() {
  digitalWrite(Gantry1, LOW);
  digitalWrite(Gantry2, HIGH);
}

void stopGantry() {
  digitalWrite(Gantry1, HIGH);
  digitalWrite(Gantry2, HIGH);
  analogWrite(ENI, 0);
}

void setGantryPower(int power) {
  long pos = readEncoderGantry();
  if (hasZeroedGantry) {
    if (power < 0 && pos <= minGantryPosition) {
      Serial.print(" Gantry Min Hit ");
      power = 0;
    }
    if (power > 0 && pos >= maxGantryPosition) power = 0;
  }

  if (power == 0) {
    stopGantry();
  } else if (power < 0) {
    power = -power;
    gantryDirectionBackward();
  } else {
    gantryDirectionForward();
    
  }
  if (power > 255) {
    power = 255;
  }
  analogWrite(ENI, power);
}

long readEncoderGantry() {
  noInterrupts();
  long value = encoderValueGantry;
  interrupts();
  return value;
}

bool setGantryPosition(int targetPosMM, int maxSpeed) {
  int targetPos = (targetPosMM - minGantryX_MM) * gantryTicksPerMM;
  targetPos = constrain(targetPos, minGantryPosition, maxGantryPosition);
  long startLeft = readEncoderGantry();

  while (true) {
    long current = readEncoderGantry();
    long error = targetPos - current;

    bool atTarget = abs(error) <= encoderToleranceTicks;

    // Serial.print("Gantry Error: ");
    // Serial.print(error);
    if (atTarget) {
      stopGantry();
      return true;
    }
    
    pidControllerGantry.UpdateError(error);
    double output = pidControllerGantry.TotalError();
    // Serial.print(" Gantry PID Output: ");
    // Serial.print(output);

    int speed = atTarget ? 0 : pidOutputToSpeed(output, error, maxSpeed);
    setGantryPower(speed);
    // Serial.print(" Gantry Speed: ");
    // Serial.println(speed);
    delay(movementLoopDelayMs);
  }
}

bool isAtTargetPositionGantry() {
  return abs(targetPositionGantry - encoderValueGantry) < 5;
}

bool homeGantryPosition() {
  int previousGantryPos = readEncoderGantry();
  setGantryPower(-50); // Move gantry backward slowly
  delay(1000);
  int currentPosition = readEncoderGantry();
  while (true) {
    if (currentPosition == previousGantryPos){
      Serial.println("Gantry homed at position: " + String(currentPosition));
      stopGantry();
      noInterrupts();
      encoderValueGantry = 0;
      interrupts();
      hasZeroedGantry = true;
      return true;
    }
    previousGantryPos = currentPosition;
    delay(1000);
    currentPosition = readEncoderGantry();
  }
  return false;
  // while (currentPos)
}

// MARK: Extruder Functions

void extDirectionForward() {
  digitalWrite(EXT1, HIGH);
  digitalWrite(EXT2, LOW);
}

void extDirectionBackward() {
  digitalWrite(EXT1, LOW);
  digitalWrite(EXT2, HIGH);
}

void stopExtruder() {
  digitalWrite(EXT1, LOW);
  digitalWrite(EXT2, LOW);
  analogWrite(PWM_EXT, 0);
}

void setExtruderPower(int power) {
  if (power == 0) {
    stopExtruder();
  } else if (power < 0) {
    power = -power;
    extDirectionBackward();
  } else {
    extDirectionForward();
  }
  analogWrite(PWM_EXT, power);
}

bool setExtruderPosition(int targetPosMM, int maxSpeed){
  int targetPos = targetPosMM * gantryTicksPerMM;
  targetPos = constrain(targetPos, minGantryPosition, maxGantryPosition);
  long startLeft = readEncoderExtruder();

  while (true) {
    long current = readEncoderExtruder();
    long error = targetPos - current;

    bool atTarget = abs(error) <= encoderToleranceTicks;

    Serial.print("Extruder Error: ");
    Serial.print(error);
    if (atTarget) {
      stopGantry();
      return true;
    }
    
