GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
const int edfPowerMin = 1100;
const int edfPowerMax = 1900;
const int edfJoystickDefault = 1950;
int edfPower = edfPowerMin;
int edfIncrementResolution = 10;
int edfIncrement = 0;
int joystickDeadzone = 50;
bool killEverything = false;
bool joystickConnected = true;

void loop() {
  // forwards();
  // homeGantryPosition();
  // driveToCrackCenter(0.5, 0.5);
  // gantryAlign(0.5);
  // crackAuto();
  // while (true){}
  // forwards();
  // turnDegrees(90, 200);
  // while (true) {}

  // setGantryPosition(maxGantryPosition/2, 255);
  // crackAuto();
  // while (true) {}
  // Serial.println("Gantry Position: " + String(encoderValueGantry));

  // setGantryPower(0);
  // delay(1000);

  // testAutoDrive();

  // MARK: Joystick Code
  
  int leftVal=map(joystickData.vy1, 0, 4095, -255, 255);
  int rightVal=map(joystickData.vy3, 0, 4095, -255, 255);
  int gantryVal=map(joystickData.vx2, 0, 4095, -255, 255);
  if (abs(leftVal) < joystickDeadzone) {
    leftVal = 0;
  }
  if (abs(rightVal) < joystickDeadzone) {
    rightVal = 0;
  }
  if (abs(gantryVal) < joystickDeadzone) {
    gantryVal = 0;
  }
  bool button3State=joystickData.button3;
  bool button2State=joystickData.button2;
  bool button1State=joystickData.button1;

  edfIncrement = 0;
  if (joystickData.vy3 < edfJoystickDefault) {
    edfIncrement=map(joystickData.vy2, 0, edfJoystickDefault-200, -edfIncrementResolution, 0);
  } else {
    edfIncrement=map(joystickData.vy2, edfJoystickDefault+100, 4095, 0, edfIncrementResolution);
  }

  gantryVal = -gantryVal;

  edfIncrement = -edfIncrement;
  edfIncrement /= edfIncrementResolution; // Normalize to -1 to 1
  edfIncrement *= 3;
  if(button1State == 0){
    killEverything = false;
    // hasZeroedGantry = true;
    autonomous = false;
  } else if(button3State == 0){
    killEverything = true;
  }
  if (killEverything || !joystickConnected) {
    edfPower = edfPowerMin;
    servo.writeMicroseconds(edfPower); // output to edfs
    stopAllDriveMotors();
    analogWrite(ENI, 0);
    setExtruderPower(0);
  } else {
    if (button2State == 0) {
      edfPower += edfIncrement;
      edfPower = constrain(edfPower, edfPowerMin, edfPowerMax);
      servo.writeMicroseconds(edfPower); // output to edfs
    } 
    // else if (button2State == 0 && button1State == 0) {
    //   autonomous = true;
    // }
    Serial.print("Setting Speed");
    setSpeed(leftVal, rightVal);
    setGantryPower(gantryVal);
  }
  
  Serial.print(" EDF Increment: ");
  Serial.print(edfIncrement);
  Serial.print(" EDF Power: ");
  Serial.print(edfPower);
  Serial.print(" Left Val: ");
  Serial.print(leftVal);
  Serial.print(" Right Val: ");
  Serial.print(rightVal);
  Serial.print(" Gantry Val: ");
  Serial.print(gantryVal);
  Serial.print(" Kill Everything: ");
  Serial.print(killEverything);
  Serial.println();
  
  
  // // Serial.println(encoderValueLeft + " hello " + encoderValueRight);

  // // driveDistance(700, 255);

  // // Serial.print(String(encoderValueLeft));
  // // Serial.print(", ");
  // // Serial.print(String(encoderValueRight));
  // // Serial.print(", ");
  // // Serial.println(String(encoderValueGantry));

  // // digitalWrite(Gantry1, HIGH);
  // // digitalWrite(Gantry2, LOW);
  // // analogWrite(ENI, 100);

  // if (BS.available() > 0) {
  //   String rawData = Serial.readStringUntil('\n');
  //   rawData.trim();
  //   if (rawData.length() > 0) {
  //     int cxIndex = rawData.indexOf("cx");
  //     int cyIndex = rawData.indexOf("cy");
  //     int xIndex = rawData.indexOf("x1");
  //     String xData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);
  //     String yData = rawData.substring(cyIndex + 4, xIndex - cyIndex - 3);
  //     cx = xData.toFloat();
  //     cy = yData.toFloat();
  //   Serial.println(rawData);
  //   }
  // }

  // if(autonomous){
  //   if(cx == 0 && cy == 0){
  //   if(isDriveAligned()){
  //     Serial.println("Drive aligned with crack center");
  //     }
  //   } else {
  //     // driveToCrackCenter(cx, cy);
  //   }
  // }

  // turnDegrees(180 , 200);
  // turnDegrees2(90);


  // setSpeed(255, 255);

  // Serial.print(String((ENCAFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCBFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCAFL)));
  // Serial.print(", ");
  // Serial.println(String(digitalRead(ENCBFL)));
}

 
